[
{
    "pic": "https://cdn2.unrealengine.com/hands-on-with-battlefield-2042-season-6-update-dark-creations-1920x1080-629710a5e4f7.jpg?h=480&quality=medium&resize=1&w=854",
    "title": "Every Video Game Release Coming Soon For Xbox Series X|S And Xbox One",
    "text": "As the Xbox Series X/S enjoys its third year, Microsoft's platform is gradually amassing a respectable library. Consoles typically do not start to flourish until the latter half of their existence, once cross-gen stops being a priority and developers can focus exclusively on crafting projects for only the most modern systems. The Xbox Series X/S has yet to reach that point, although things are moving in that direction."
},


{
    "pic": "https://static0.gamerantimages.com/wordpress/wp-content/uploads/2023/06/upcoming-ps5-games-spider-man-2-silent-hill-f-and-phantom-blade-0.jpg?q=50&fit=contain&w=943&h=&dpr=1.5",
    "title": "Every Video Game Release Coming Soon For PS5 And PS4",
    "text": "2023 has kept PlayStation owners busy. This year has already produced Resident Evil 4 (remake), Diablo 4, Street Fighter 6, Final Fantasy 16, and Hogwarts Legacy, just to mention a few major releases."
},

{
    "pic": "https://static0.gamerantimages.com/wordpress/wp-content/uploads/2023/10/call-of-duty-modern-warfare-3-1.jpg?q=50&fit=contain&w=943&h=&dpr=1.5",
    "title": "Call of Duty: Modern Warfare 3 Fans Are Loving One New Lethal Item",
    "text": "Sledgehammer Games recently unveiled the Breacher Drone, a new lethal weapon for Call of Duty: Modern Warfare 3. Since its introduction, the Breacher Drone has received considerable positive feedback, with players highlighting the enriched strategic depth it contributes to Activision's Call of Duty: Modern Warfare 3, slated for release on November 10. For the first time, two consecutive Modern Warfare titles are being released, with Call of Duty: Modern Warfare 3 following last year's Modern Warfare 2 and the 2019 reboot of the franchise. The Call of Duty: Modern Warfare 3 beta is currently live and accessible to PlayStation users, and it's worth noting that it's open to all users on the platform without the need for pre-ordering the game. As for the Xbox and PC players eagerly awaiting their chance to dive into the action, they can mark their calendars for October 12, when they'll be able to join the beta. Following this, from October 14 to 16, the beta will be available to all users across all platforms, ensuring an inclusive gaming experience."
},

{
    "pic": "https://static0.gamerantimages.com/wordpress/wp-content/uploads/wm/2023/10/overwatch-2-bugged-skins.jpg?q=50&fit=contain&w=943&h=&dpr=1.5",
    "title": "These Overwatch 2 Skins Have Been Bugged For Over a Year",
    "text": "With Overwatch 2 now reaching its first year early access anniversary launch, one player compiles a complete list of currently bugged character skins that have been available since last year. Unlike its predecessor, Overwatch 2 adopted a free to play model, allowing players to jump into a match without having to first pay a premium price. As such, Blizzard uses monetization methods to fund the game, releasing battle passes, new cosmetic items, and recently, the ability to play new PvE missions through a paid DLC pack. While the live service nature has led to plenty of updates, changes, and new content for the better, the monetization aspect remains a frustrating component for many players, especially with some of the prices within the in-game Overwatch 2 store. Things have improved since Overwatch 2 launched into early access last year, with missing features and new modes being added over time, characters being reworked to make them viable, and more. However, some of the smaller details remain a work in progress as one player notes with a handful of bugged skins for various characters."
},

{
    "pic": "https://static0.gamerantimages.com/wordpress/wp-content/uploads/2023/10/spider-man-change-cover.jpg?q=50&fit=contain&w=943&h=&dpr=1.5",
    "title": "Marvel's Spider-Man Player Notices Interesting Change in Remastered Version",
    "text": "A Marvel's Spider-Man player finds a subtle difference while playing the Remastered version. While Marvel's Spider-Man 2 is on the horizon, some fans have been preparing for the sequel by playing the previous Spider-Man games. The original entry in the series first came out on PS4 in 2018, and it received a remaster in 2022. While the game has mostly retained the majority of its assets, some items were altered, such as the Peter Parker model. However, many players still continue to discover minor Easter eggs and small changes during their playthroughs of the PlayStation exclusive. While changes and differences are a common find between the Remastered and the original version, some replays have led to the discovery of previously unknown mechanics and details. One minor discovery was the existence of Marvel's Spider-Man's combo counter limit. These findings aren't much of a big deal, but they do pose questions as to what secrets players can still finuncoverd. One eagle-eyed player found a minor cutscene change that has led to a deeper discussion."
},

{
    "pic": "https://static0.gamerantimages.com/wordpress/wp-content/uploads/2023/10/starfield-theft-cover.jpg?q=50&fit=contain&w=943&h=&dpr=1.5",
    "title": "Starfield Players Call for Helpful Feature for When They Accidentally Steal",
    "text": "A Starfield player has put out a call to developers to add a feature that can assist them when they accidentally steal something. As with many other open-world Bethesda RPGs, Starfield's in-game universe is populated by many items to find and discover. Some are useful, while a lot of it is mostly filler materials. Some players have found solutions by providing creative ways on where to put Starfield's player cargo. Granted, it's so easy to get lost in the game world and just take items inadvertently because of how populated it is. In fact, it seems Bethesda may need to review how some interactions work especially when dealing with items. There was one report of an NPC overreaction when a Starfield player lifted a cocktail shaker. While most find this hilarious, some players are actually hoping for the developers to tone it down a bit. One Reddit User has posed a question asking if Bethesda could consider adding an option to prevent such stand-offs from happening."
},

{
    "pic": "https://static0.gamerantimages.com/wordpress/wp-content/uploads/2023/10/minecraft-forest-mountains-lake.jpg?q=50&fit=contain&w=943&h=&dpr=1.5",
    "title": "Minecraft Players Build Incredible Medieval Kingdom",
    "text": "Some incredibly talented Minecraft players have accomplished a spectacular feat as they managed to build an immense medieval in-game kingdom. The medieval-themed Minecraft creation spans an astonishing 2000x2000 blocks and is made up of many different buildings, a snug little farm, a harbor city, several villages, castles, and taverns with each location connected by roads and bridges. Minecraft is widely regarded as one of the best video games that can serve as an outlet for unleashing players' creative potential, as its sandbox nature offers lots of opportunities for exploration and personal expression. Inventive gamers are limited only by their imagination as they construct sophisticated structures, landscapes, or even entire cities by taking advantage of Minecraft's enormous number of building blocks and crafting tools."
},

{
    "pic": "https://static0.gamerantimages.com/wordpress/wp-content/uploads/2023/10/silent-hill-2-remake-steam-update.jpg?q=50&fit=contain&w=943&h=&dpr=1.5",
    "title": "Silent Hill 2 Remake Gets Promising Update on Steam",
    "text": "Some recent changes have been made on the Silent Hill 2 remake's official Steam page, which may indicate fans will hear more about the game from Konami and Bloober Team soon. The original 2001 release of Silent Hill 2 was a hallmark of horror games that many gamers believe hasn't been topped to this day. When Konami announced back in 2022 that it would be remaking the seminal horror classic, many fans were excited but also cautious. After this reveal, however, news regarding the game has mostly been silent. Several rumors had been spread about this remake throughout 2023, especially regarding its release date, with many answers and leaks giving different days or windows. This ranges from asking one of the voice actors when Silent Hill 2's remake would release to various retailers or sources giving a solidified date while being open for pre-orders. The conflicting answers and dates make things harder to determine what information is reliable or not. A new update made to the game's Steam page possibly gives an indication about how Konami and Bloober Team will give more news about it soon."
},


{
    "pic": "https://static0.gamerantimages.com/wordpress/wp-content/uploads/2023/07/xbox-series-x-and-s-consoles.jpg?q=50&fit=contain&w=767&h=&dpr=1.5",
    "title": "Some Xbox Gamers Are Getting a Weird 'What Do You Want to Do' Message",
    "text": "Owners of various Xbox consoles have reported a weird bug that displays a ''What do you want to do?'' message and alters the text and UI on their dashboards. It's not the first time an Xbox console has dealt with a prominent bug, but thankfully, this one's harmless. The Xbox Series X and S are the latest consoles from Xbox. Collectively, they mark Xbox's ninth generation gaming consoles and have sold over 21 million units as of July of this year."
},

{
    "pic": "https://static0.gamerantimages.com/wordpress/wp-content/uploads/2023/10/assassin-s-creed-mirage-discovers-surprising-cat-detail.jpg?q=50&fit=contain&w=767&h=&dpr=1.5",
    "title": "Assassin's Creed Mirage Player Spots Surprising Cat Detail",
    "text": "An Assassin's Creed Mirage fan spotted a surprising detail with one of the cats. The 13th installment in the Assassin's Creed franchise explores Basim's past as the story returns to the Middle East, with players and critics alike calling it a love letter to the earlier titles. Released on October 5, Assassin's Creed Mirage received mostly favorable reviews upon launch, with critics praising its parkour and stealth mechanics. Although Ubisoft received backlash for adding the controversial Denuvo DRM in Assassin's Creed Mirage, it didn't seem to affect its overall reception. Many players have been taking their sweet time finding secrets in the game, including the adorable cats they'll encounter along the way."
}

]